[Survived] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:14:13
         {
             var keyValue = TryGetConfigValue(builder.Configuration, "WBJwtKey");
             builder.Services.AddAuthentication(options =>
-            {
-                options.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-                options.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-                options.DefaultScheme = JwtBearerDefaults.AuthenticationScheme;
-            }).AddJwtBearer(options =>
+            {}).AddJwtBearer(options =>
             {
                 options.TokenValidationParameters = new TokenValidationParameters

[Survived] Boolean mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:30:45
                     ValidAudience = TryGetConfigValue(builder.Configuration, "WBAudience"),
                     IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(keyValue!)),
                     ClockSkew = TimeSpan.Zero,
-                    RequireExpirationTime = true
+                    RequireExpirationTime = false
                 };
                 options.Events = new JwtBearerEvents

[Survived] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:36:29
                 {
                     OnAuthenticationFailed = async context =>
                     {
-                        if (context.Exception.GetType() == typeof(SecurityTokenExpiredException))
+                        if (context.Exception.GetType() != typeof(SecurityTokenExpiredException))
                         {
                             context.Response.StatusCode = 401;

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:49:29
                                 details = "token_expired"
                             };
 
-                            await context.Response.WriteAsync(JsonSerializer.Serialize(response));
+                            ;
                         }
                     }
killedBy: WorthBoards.IntegrationTests.Controllers.UserControllerIntegrationTests.GetUserById_WithExpiredToken_ReturnsUnauthorized

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:55:29
                     ,
                     OnChallenge = context =>
                     {
-                        if (!context.Response.HasStarted)
+                        if (context.Response.HasStarted)
                             context.Response.StatusCode = 401;
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithoutAuthorization_ReturnsUnauthorized; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.CreateBoard_WithoutAuthorization_ReturnsUnauthorized; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithoutAuthorization_ReturnsUnauthorized

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:58:25
                         if (!context.Response.HasStarted)
                             context.Response.StatusCode = 401;
 
-                        context.HandleResponse();
+                        ;
                         return Task.CompletedTask;
                     }
killedBy: WorthBoards.IntegrationTests.Controllers.UserControllerIntegrationTests.GetUserById_WithExpiredToken_ReturnsUnauthorized

[Timeout] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:71:17
         {
             var value = configuration[key];
 
-            if (value is null)
+            if (value is not null)
             {
                 Console.WriteLine($"[ERROR] Missing configuration value for key '{key}'");

[NoCoverage] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:73:17
 
             if (value is null)
             {
-                Console.WriteLine($"[ERROR] Missing configuration value for key '{key}'");
+                ;
                 Environment.Exit(1);
             }

[NoCoverage] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthenticationConfiguration.cs:74:17
             if (value is null)
             {
                 Console.WriteLine($"[ERROR] Missing configuration value for key '{key}'");
-                Environment.Exit(1);
+                ;
             }
 
