[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/EmailConfiguration.cs:9:13
     {
         public static WebApplicationBuilder ConfigureGmail(this WebApplicationBuilder builder)
         {
-            builder.Services.Configure<GmailOptions>(
-                builder.Configuration.GetSection(GmailOptions.GmailOptionsKey)
-                );
+            ;
 
             return builder;
