[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthorizationConfiguration.cs:11:13
     {
         public static WebApplicationBuilder ConfigureAuthorization(this WebApplicationBuilder builder)
         {
-            builder.Services.AddAuthorization(options =>
-            {
-                foreach (UserRoleEnum role in Enum.GetValues(typeof(UserRoleEnum)))
-                {
-                    AddRolePolicy(options, role);
-                }
-            });
+            ;
 
             return builder;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthorizationConfiguration.cs:15:21
             {
                 foreach (UserRoleEnum role in Enum.GetValues(typeof(UserRoleEnum)))
                 {
-                    AddRolePolicy(options, role);
+                    ;
                 }
             });
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthorizationConfiguration.cs:25:13
         private static void AddRolePolicy(AuthorizationOptions options, UserRoleEnum role)
         {
             string roleStr = role.ToString();
-            options.AddPolicy(roleStr, policy =>
-            {
-                policy.Requirements.Add(new PermissionRequirement(role));
-            });
+            ;
         }
     }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/AuthorizationConfiguration.cs:27:17
             string roleStr = role.ToString();
             options.AddPolicy(roleStr, policy =>
             {
-                policy.Requirements.Add(new PermissionRequirement(role));
+                ;
             });
         }
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest
