[Survived] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:14:87
                 .MinimumLevel.Information()
                 .Enrich.FromLogContext()
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByExcluding(Matching.WithProperty<string>("LogType", p => p == "Http" && p == "Controller"))
+                    .Filter.ByExcluding(Matching.WithProperty<string>("LogType", p => p != "Http" && p == "Controller"))
                     .WriteTo.File("Logs/General/general.log", rollingInterval: RollingInterval.Hour)
 

[Survived] Logical mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:14:87
                 .MinimumLevel.Information()
                 .Enrich.FromLogContext()
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByExcluding(Matching.WithProperty<string>("LogType", p => p == "Http" && p == "Controller"))
+                    .Filter.ByExcluding(Matching.WithProperty<string>("LogType", p => p == "Http" || p == "Controller"))
                     .WriteTo.File("Logs/General/general.log", rollingInterval: RollingInterval.Hour)
 

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:15:35
                 .Enrich.FromLogContext()
                 .WriteTo.Logger(lc => lc
                     .Filter.ByExcluding(Matching.WithProperty<string>("LogType", p => p == "Http" && p == "Controller"))
-                    .WriteTo.File("Logs/General/general.log", rollingInterval: RollingInterval.Hour)
+                    .WriteTo.File("", rollingInterval: RollingInterval.Hour)
 
                 )

[Survived] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:19:91
 
                 )
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Http"))
+                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p != "Http"))
                     .WriteTo.File("Logs/Http/http.log", rollingInterval: RollingInterval.Hour)
                 )

[Survived] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:23:91
                     .WriteTo.File("Logs/Http/http.log", rollingInterval: RollingInterval.Hour)
                 )
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Controller"))
+                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p != "Controller"))
                     .WriteTo.File("Logs/Controller/controller.log", rollingInterval: RollingInterval.Hour)
                 )

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:23:75
                     .WriteTo.File("Logs/Http/http.log", rollingInterval: RollingInterval.Hour)
                 )
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Controller"))
+                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("", p => p == "Controller"))
                     .WriteTo.File("Logs/Controller/controller.log", rollingInterval: RollingInterval.Hour)
                 )

[Survived] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:27:91
                     .WriteTo.File("Logs/Controller/controller.log", rollingInterval: RollingInterval.Hour)
                 )
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Email"))
+                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p != "Email"))
                     .WriteTo.File("Logs/Email/email.log", rollingInterval: RollingInterval.Hour)
                 )

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:27:75
                     .WriteTo.File("Logs/Controller/controller.log", rollingInterval: RollingInterval.Hour)
                 )
                 .WriteTo.Logger(lc => lc
-                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Email"))
+                    .Filter.ByIncludingOnly(Matching.WithProperty<string>("", p => p == "Email"))
                     .WriteTo.File("Logs/Email/email.log", rollingInterval: RollingInterval.Hour)
                 )

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:28:35
                 )
                 .WriteTo.Logger(lc => lc
                     .Filter.ByIncludingOnly(Matching.WithProperty<string>("LogType", p => p == "Email"))
-                    .WriteTo.File("Logs/Email/email.log", rollingInterval: RollingInterval.Hour)
+                    .WriteTo.File("", rollingInterval: RollingInterval.Hour)
                 )
                 .WriteTo.Console()

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SerilogLoggerConfiguration.cs:33:13
                 .WriteTo.Console()
                 .CreateLogger();
 
-            builder.Host.UseSerilog();
+            ;
 
             return builder;
