[NoCoverage] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SwaggerConfiguration.cs:12:68
             builder.Services.AddEndpointsApiExplorer();
             builder.Services.AddSwaggerGen(options =>
             {
-                options.SwaggerDoc("v1", new OpenApiInfo { Title = "Worth Boards API", Version = "v1" });
+                options.SwaggerDoc("v1", new OpenApiInfo { Title = "", Version = "v1" });
 
                 // Add security definition

[NoCoverage] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SwaggerConfiguration.cs:12:98
             builder.Services.AddEndpointsApiExplorer();
             builder.Services.AddSwaggerGen(options =>
             {
-                options.SwaggerDoc("v1", new OpenApiInfo { Title = "Worth Boards API", Version = "v1" });
+                options.SwaggerDoc("v1", new OpenApiInfo { Title = "Worth Boards API", Version = "" });
 
                 // Add security definition

[NoCoverage] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/SwaggerConfiguration.cs:17:28
                 // Add security definition
                 options.AddSecurityDefinition("Bearer", new OpenApiSecurityScheme
                 {
-                    Name = "Authorization",
+                    Name = "",
                     Type = SecuritySchemeType.ApiKey,
                     Scheme = "Bearer",
