[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/ValidatorConfiguration.cs:12:9
     {
         ArgumentNullException.ThrowIfNull(builder, nameof(builder));
 
-        builder.Services
-            .AddFluentValidationAutoValidation()
-            .AddFluentValidationClientsideAdapters()
-            .AddValidatorsFromAssembly(Assembly.Load("WorthBoards.Business"));
+        ;
 
         return builder;
killedBy: WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.CreateComment_WithEmptyContent_ReturnsBadRequest

[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Configurations/ValidatorConfiguration.cs:15:54
         builder.Services
             .AddFluentValidationAutoValidation()
             .AddFluentValidationClientsideAdapters()
-            .AddValidatorsFromAssembly(Assembly.Load("WorthBoards.Business"));
+            .AddValidatorsFromAssembly(Assembly.Load(""));
 
         return builder;
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest
