[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:20:9
         [AllowAnonymous]
         [HttpPost("/register")]
         public async Task<IActionResult> RegisterUserAsync([FromBody] UserRegisterRequest request, CancellationToken cancellationToken)
-        {
-            var response = await authService.RegisterUserAsync(request, cancellationToken);
-            return Ok(response);
-        }
+        {}
 
         [AllowAnonymous]
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.RegisterUserAsync_WithInvalidEmail_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.RegisterUserAsync_WithValidPayload_ReturnsOkAndCreatesUser; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.RegisterUserAsync_WithWeakPassword_ReturnsBadRequest

[Killed] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:30:17
         public async Task<IActionResult> LoginUserAsync([FromBody] UserLoginRequest credentials, CancellationToken cancellationToken)
         {
             // Validate input
-            if (string.IsNullOrWhiteSpace(credentials.UserName))
+            if (!(string.IsNullOrWhiteSpace(credentials.UserName)))
                 return BadRequest("Username is required.");
             if (string.IsNullOrWhiteSpace(credentials.Password))
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin

[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:30:17
         public async Task<IActionResult> LoginUserAsync([FromBody] UserLoginRequest credentials, CancellationToken cancellationToken)
         {
             // Validate input
-            if (string.IsNullOrWhiteSpace(credentials.UserName))
+            if ((credentials.UserName!=null))
                 return BadRequest("Username is required.");
             if (string.IsNullOrWhiteSpace(credentials.Password))
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithIncorrectPassword_ReturnsUnauthorized

[Killed] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:32:17
             // Validate input
             if (string.IsNullOrWhiteSpace(credentials.UserName))
                 return BadRequest("Username is required.");
-            if (string.IsNullOrWhiteSpace(credentials.Password))
+            if (!(string.IsNullOrWhiteSpace(credentials.Password)))
                 return BadRequest("Password is required.");
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyPassword_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin

[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:32:17
             // Validate input
             if (string.IsNullOrWhiteSpace(credentials.UserName))
                 return BadRequest("Username is required.");
-            if (string.IsNullOrWhiteSpace(credentials.Password))
+            if ((credentials.Password!=""))
                 return BadRequest("Password is required.");
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyPassword_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:36:13
                 return BadRequest("Password is required.");
 
             try
-            {
-                var response = await authService.LoginUserAsync(credentials, cancellationToken);
-                return Ok(response);
-            }
+            {}
             catch (UnauthorizedException)
             {
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithIncorrectPassword_ReturnsUnauthorized

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:41:13
                 return Ok(response);
             }
             catch (UnauthorizedException)
-            {
-                return Unauthorized();
-            }
+            {}
             catch (NotFoundException)
             {
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithIncorrectPassword_ReturnsUnauthorized

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:45:13
                 return Unauthorized();
             }
             catch (NotFoundException)
-            {
-                return Unauthorized();
-            }
+            {}
             catch (Exception)
             {
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithNonexistentUser_ReturnsUnauthorized

[NoCoverage] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:49:13
                 return Unauthorized();
             }
             catch (Exception)
-            {
-                return Problem();
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:57:9
         [AllowAnonymous]
         [HttpPost("/forgot-password")]
         public async Task<IActionResult> ForgotPassword([FromBody] ForgotPasswordRequest forgotPasswordRequest, CancellationToken cancellationToken)
-        {
-            var response = await authService.ForgotPasswordAsync(forgotPasswordRequest, cancellationToken);
-
-            return Ok(response);
-        }
+        {}
 
         [AllowAnonymous]

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:66:9
         [AllowAnonymous]
         [HttpPost("/reset-password")]
         public async Task<IActionResult> ResetPassword([FromBody] ResetPasswordRequest resetPasswordRequest, CancellationToken cancellationToken)
-        {
-            var response = await authService.ResetPasswordAsync(resetPasswordRequest, cancellationToken);
-
-            return Ok(response);
-        }
+        {}
 
         [Authorize]
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithValidResetCode_ReturnsOkAndAllowsLogin

[Survived] Null coalescing mutation (remove right)
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:76:25
         [HttpPost("/change-password")]
         public async Task<IActionResult> ChangePassword([FromBody] ChangePasswordRequest changePasswordRequest, CancellationToken cancellationToken)
         {
-            var email = User.FindFirstValue(ClaimTypes.Email)
-                ?? throw new UnauthorizedAccessException(ErrorMessageConstants.EMAIL_NOT_FOUND_IN_TOKEN);
+            var email = User.FindFirstValue(ClaimTypes.Email);
 
             // Validate that old and new passwords are different

[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:80:17
                 ?? throw new UnauthorizedAccessException(ErrorMessageConstants.EMAIL_NOT_FOUND_IN_TOKEN);
 
             // Validate that old and new passwords are different
-            if (changePasswordRequest.OldPassword == changePasswordRequest.NewPassword)
+            if (changePasswordRequest.OldPassword != changePasswordRequest.NewPassword)
                 return BadRequest("New password must be different from old password.");
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithSameOldAndNewPassword_ReturnsBadRequest

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:84:13
                 return BadRequest("New password must be different from old password.");
 
             try
-            {
-                var response = await authService.ChangePasswordAsync(changePasswordRequest, email, cancellationToken);
-                return Ok(response);
-            }
+            {}
             catch (BadRequestException ex)
             {
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithIncorrectOldPassword_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithWeakNewPassword_ReturnsBadRequest

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/AuthController.cs:89:13
                 return Ok(response);
             }
             catch (BadRequestException ex)
-            {
-                return BadRequest(ex.Message);
-            }
+            {}
             catch (Exception)
             {
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithIncorrectOldPassword_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithWeakNewPassword_ReturnsBadRequest
