[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:18:9
         [HttpGet("{boardId}/tasks")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetAllActiveBoardTasks(int boardId, CancellationToken cancellationToken)
-        {
-            IEnumerable<TaskStatusEnum> taskStatuses = [TaskStatusEnum.PENDING, TaskStatusEnum.IN_PROGRESS, TaskStatusEnum.COMPLETED];
-            var boardTasksResponse = await _boardTaskService.GetBoardTasks(boardId, taskStatuses, cancellationToken);
-
-            return Ok(boardTasksResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/tasks/archived")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.GetAllActiveBoardTasks_WithValidBoardId_ReturnsOkAndActiveTasks

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:28:9
         [HttpGet("{boardId}/tasks/archived")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetAllArchivedBoardTasks(int boardId, CancellationToken cancellationToken)
-        {
-            IEnumerable<TaskStatusEnum> taskStatuses = [TaskStatusEnum.ARCHIVED];
-            var boardTasksResponse = await _boardTaskService.GetBoardTasks(boardId, taskStatuses, cancellationToken);
-
-            return Ok(boardTasksResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/tasks/{boardTaskId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.GetAllArchivedBoardTasks_WithValidBoardId_ReturnsOkAndArchivedTasks

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:38:9
         [HttpGet("{boardId}/tasks/{boardTaskId}")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetBoardTaskById(int boardId, int boardTaskId, CancellationToken cancellationToken)
-        {
-            var boardTaskResponse = await _boardTaskService.GetBoardTaskById(boardId, boardTaskId, cancellationToken);
-            return Ok(boardTaskResponse);
-        }
+        {}
 
         [HttpPost("{boardId}/tasks")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.GetBoardTaskById_WithValidIds_ReturnsOkAndTaskData; WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.GetBoardTaskById_WithNonexistentTask_ReturnsNotFound

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:49:13
         {
             int userId = UserHelper.GetUserId(User).Value;
             var boardTaskResponse = await _boardTaskService.CreateBoardTask(boardId, boardTaskRequest, cancellationToken);
-            await _notificationService.NotifyTaskCreated(boardId, boardTaskResponse.Id, userId, cancellationToken);
+            ;
             return CreatedAtAction(nameof(GetBoardTaskById), new { boardId = boardId, boardTaskId = boardTaskResponse.Id}, boardTaskResponse);
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.CreateBoardTask_WithValidData_ReturnsCreatedAndTaskData

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:57:13
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> DeleteBoardTask(int boardId, int boardTaskId, CancellationToken cancellationToken)
         {
-            await _boardTaskService.DeleteBoardTask(boardId, boardTaskId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.DeleteBoardTask_WithValidIds_ReturnsNoContent

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:65:13
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> DeleteArchivedBoardTasks(int boardId, CancellationToken cancellationToken)
         {
-            await _boardTaskService.DeleteArchivedBoardTasks(boardId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.DeleteArchivedBoardTasks_WithValidBoard_DeletesOnlyArchivedTasks

[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:79:17
 
             var boardTaskResponse = await _boardTaskService.UpdateBoardTask(boardId, boardTaskId, boardTaskRequest, cancellationToken);
 
-            if (oldStatus != newStatus)
+            if (oldStatus == newStatus)
             {
                 int userId = UserHelper.GetUserId(User).Value;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.UpdateBoardTask_WithValidData_ReturnsOkAndUpdatedTask

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:82:17
             if (oldStatus != newStatus)
             {
                 int userId = UserHelper.GetUserId(User).Value;
-                await _notificationService.NotifyTaskStatusChange(boardId, boardTaskId, userId, oldStatus, newStatus, cancellationToken);
+                ;
                 return Ok(boardTaskResponse);
             }

[NoCoverage] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardTaskController.cs:92:9
         [HttpPatch("{boardId}/tasks/{boardTaskId}")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> PatchBoardTask(int boardId, int boardTaskId, [FromBody] JsonPatchDocument<BoardTaskUpdateRequest> taskBoardPatchDoc, CancellationToken cancellationToken)
-        {
-            var boardTaskResponse = await _boardTaskService.PatchBoardTask(boardId, boardTaskId, taskBoardPatchDoc, cancellationToken);
-            return Ok(boardTaskResponse);
-        }
+        {}
     }
 }
