[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/TaskOnUserController.cs:26:21
 
             foreach (var response in linkResponse)
             {
-                if (response.UserId != userId.Value)
+                if (response.UserId == userId.Value)
                     await _notificationService.NotifyTaskAssigned(boardId, taskId, response.UserId, userId.Value, cancellationToken);
             }
killedBy: WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.LinkUsersToTask_WithUserNotOnBoard_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.LinkUsersToTask_WithValidUsers_ReturnsOkAndAssignsUsers

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/TaskOnUserController.cs:27:21
             foreach (var response in linkResponse)
             {
                 if (response.UserId != userId.Value)
-                    await _notificationService.NotifyTaskAssigned(boardId, taskId, response.UserId, userId.Value, cancellationToken);
+                    ;
             }
 

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/TaskOnUserController.cs:36:9
         [HttpDelete("{boardId}/tasks/{taskId}/users/unlink")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> UnlinkUsersFromTask(int boardId, int taskId, [FromBody] IEnumerable<LinkUserToTaskRequest> linkList, CancellationToken cancellationToken)
-        {
-            var unlinkResponse = await _taskOnUserService.UnlinkUsersFromTaskAsync(boardId, taskId, linkList, cancellationToken);
-            return Ok(unlinkResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/tasks/{taskId}/users")]
killedBy: WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.UnlinkUsersFromTask_WithAssignedUsers_ReturnsOkAndUnassignsUsers

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/TaskOnUserController.cs:44:9
         [HttpGet("{boardId}/tasks/{taskId}/users")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetUsersLinkedToTask(int boardId, int taskId, CancellationToken cancellationToken)
-        {
-            var usersResponse = await _taskOnUserService.GetUsersLinkedToTaskAsync(boardId, taskId, cancellationToken);
-            return Ok(usersResponse);
-        }
+        {}
     }
 }
killedBy: WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.GetUsersLinkedToTask_WithNoAssignedUsers_ReturnsOkAndEmptyList; WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.GetUsersLinkedToTask_WithNonexistentTask_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.TaskOnUserControllerIntegrationTests.GetUsersLinkedToTask_WithAssignedUsers_ReturnsOkAndUserList
