[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:20:17
         [Authorize]
         public async Task<IActionResult> GetAllCurrentUserBoards([FromQuery] int? userId, CancellationToken cancellationToken, [FromQuery] int pageNum = 0, [FromQuery] int pageSize = 10)
         {
-            if (userId == null)
+            if (userId != null)
             {
                 var userID = UserHelper.GetUserId(User);
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithValidUser_ReturnsOkAndBoardList; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithPagination_ReturnsPaginatedResults

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:21:13
         public async Task<IActionResult> GetAllCurrentUserBoards([FromQuery] int? userId, CancellationToken cancellationToken, [FromQuery] int pageNum = 0, [FromQuery] int pageSize = 10)
         {
             if (userId == null)
-            {
-                var userID = UserHelper.GetUserId(User);
-                if (userID.Result is UnauthorizedObjectResult unauthorizedResult)
-                    return unauthorizedResult;
-
-                userId = userID.Value;
-            }
+            {}
 
             var (boards, totalCount) = await _boardService.GetUserBoardsAsync(userId.Value, pageNum, pageSize, cancellationToken);
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithValidUser_ReturnsOkAndBoardList; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithPagination_ReturnsPaginatedResults

[Survived] Arithmetic mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:31:69
 
             var (boards, totalCount) = await _boardService.GetUserBoardsAsync(userId.Value, pageNum, pageSize, cancellationToken);
             
-            var pageCount = totalCount == 0 ? 1 : (int)Math.Ceiling((double)totalCount / pageSize);
+            var pageCount = totalCount == 0 ? 1 : (int)Math.Ceiling((double)totalCount * pageSize);
             return Ok(new { items = boards, pageNumber = pageNum, pageCount, pageSize });
         }

[Survived] Conditional (false) mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:31:29
 
             var (boards, totalCount) = await _boardService.GetUserBoardsAsync(userId.Value, pageNum, pageSize, cancellationToken);
             
-            var pageCount = totalCount == 0 ? 1 : (int)Math.Ceiling((double)totalCount / pageSize);
+            var pageCount = (false?1 :(int)Math.Ceiling((double)totalCount / pageSize));
             return Ok(new { items = boards, pageNumber = pageNum, pageCount, pageSize });
         }

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:42:17
             var userId = UserHelper.GetUserId(User).Value;
             try
             {
-                await _boardOnUserService.GetBoardToUserLink(boardId, userId, cancellationToken);
+                ;
             }
             catch
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithUnauthorizedUser_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithNonexistentBoard_ReturnsNotFound

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:45:13
                 await _boardOnUserService.GetBoardToUserLink(boardId, userId, cancellationToken);
             }
             catch
-            {
-                return Forbid();
-            }
+            {}
 
             var boardResponse = await _boardService.GetBoardByIdAsync(boardId, cancellationToken);
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithUnauthorizedUser_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithNonexistentBoard_ReturnsNotFound

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:74:13
         [AuthorizeRole(UserRoleEnum.OWNER)]
         public async Task<IActionResult> DeleteBoard(int boardId, CancellationToken cancellationToken)
         {
-            await _boardService.DeleteBoardAsync(boardId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.DeleteBoard_WithValidBoardAsOwner_ReturnsNoContent

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:81:9
         [HttpPut("{boardId}")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> UpdateBoard(int boardId, [FromBody] BoardUpdateRequest boardRequest, CancellationToken cancellationToken)
-        {
-            var boardResponse = await _boardService.UpdateBoardAsync(boardId, boardRequest, cancellationToken);
-            return Ok(boardResponse);
-        }
+        {}
 
         [HttpPatch("{boardId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithValidData_ReturnsOkAndUpdatedBoard

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:89:9
         [HttpPatch("{boardId}")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> PatchBoard(int boardId, [FromBody] JsonPatchDocument<BoardUpdateRequest> taskBoardPatchDoc, CancellationToken cancellationToken)
-        {
-            var boardResponse = await _boardService.PatchBoardAsync(boardId, taskBoardPatchDoc, cancellationToken);
-            return Ok(boardResponse);
-        }
+        {}
     }
 }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithValidPatch_ReturnsOkAndAppliesChanges
