[Killed] Block removal mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:15:9
         private readonly IBoardService _boardService;
 
         public ControllerLoggingActionFilter(ILogger<ControllerLoggingActionFilter> logger, IBoardService boardService)
-        {
-            _logger = logger;
-            _boardService = boardService;
-        }
+        {}
 
         public async Task OnActionExecutionAsync(ActionExecutingContext context, ActionExecutionDelegate next)
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Survived] Statement mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:22:13
 
         public async Task OnActionExecutionAsync(ActionExecutingContext context, ActionExecutionDelegate next)
         {
-            await OnActionExecuting(context);
+            ;
 
             var resultContext = await next();

[Survived] Statement mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:26:13
 
             var resultContext = await next();
 
-            OnActionExecuted(resultContext);
+            ;
         }
 

[Survived] Conditional (true) mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:32:30
         public async Task OnActionExecuting(ActionExecutingContext context)
         {
             var role = await GetRoleWithBoardIdAsync(context.HttpContext);
-            var roleString = string.IsNullOrWhiteSpace(role.Item1.ToString()) ? "NONE" : role.Item1.ToString();
+            var roleString = (true?"NONE" :role.Item1.ToString());
             var boardIdString = string.IsNullOrWhiteSpace(role.Item2.ToString()) ? "NONE" : role.Item2.ToString();
 

[Survived] Conditional (false) mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:32:30
         public async Task OnActionExecuting(ActionExecutingContext context)
         {
             var role = await GetRoleWithBoardIdAsync(context.HttpContext);
-            var roleString = string.IsNullOrWhiteSpace(role.Item1.ToString()) ? "NONE" : role.Item1.ToString();
+            var roleString = (false?"NONE" :role.Item1.ToString());
             var boardIdString = string.IsNullOrWhiteSpace(role.Item2.ToString()) ? "NONE" : role.Item2.ToString();
 

[Survived] Conditional (true) mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:33:33
         {
             var role = await GetRoleWithBoardIdAsync(context.HttpContext);
             var roleString = string.IsNullOrWhiteSpace(role.Item1.ToString()) ? "NONE" : role.Item1.ToString();
-            var boardIdString = string.IsNullOrWhiteSpace(role.Item2.ToString()) ? "NONE" : role.Item2.ToString();
+            var boardIdString = (true?"NONE" :role.Item2.ToString());
 
             using (LogContext.PushProperty("LogType", "Controller"))

[Survived] Conditional (false) mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:33:33
         {
             var role = await GetRoleWithBoardIdAsync(context.HttpContext);
             var roleString = string.IsNullOrWhiteSpace(role.Item1.ToString()) ? "NONE" : role.Item1.ToString();
-            var boardIdString = string.IsNullOrWhiteSpace(role.Item2.ToString()) ? "NONE" : role.Item2.ToString();
+            var boardIdString = (false?"NONE" :role.Item2.ToString());
 
             using (LogContext.PushProperty("LogType", "Controller"))

[Survived] Statement mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:37:17
 
             using (LogContext.PushProperty("LogType", "Controller"))
             {
-                _logger.LogInformation("Executing action - {ActionName}, Controller: {ControllerName}, User: {UserName}, BoardRole: {BoardRole}, BoardId: {BoardId}",
-                    GetActionName(context),
-                    GetControllerName(context),
-                    UserHelper.GetUsername(context.HttpContext),
-                    roleString,
-                    boardIdString);
+                ;
             }
         }

[Survived] String mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:37:40
 
             using (LogContext.PushProperty("LogType", "Controller"))
             {
-                _logger.LogInformation("Executing action - {ActionName}, Controller: {ControllerName}, User: {UserName}, BoardRole: {BoardRole}, BoardId: {BoardId}",
+                _logger.LogInformation("",
                     GetActionName(context),
                     GetControllerName(context),

[Killed] String mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:48:44
 
         public void OnActionExecuted(ActionExecutedContext context)
         {
-            using (LogContext.PushProperty("LogType", "Controller"))
+            using (LogContext.PushProperty("", "Controller"))
             {
                 _logger.LogInformation("Finished executing action - {ActionName}, Controller: {ControllerName}, User: {UserName}",
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Survived] Statement mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:50:17
         {
             using (LogContext.PushProperty("LogType", "Controller"))
             {
-                _logger.LogInformation("Finished executing action - {ActionName}, Controller: {ControllerName}, User: {UserName}",
-                    GetActionName(context),
-                    GetControllerName(context),
-                    UserHelper.GetUsername(context.HttpContext));
+                ;
             }
         }

[Survived] Null coalescing mutation (remove left)
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:59:20
 
         private static string GetControllerName(FilterContext context)
         {
-            return context.RouteData.Values["controller"]?.ToString() ?? "None";
+            return "None";
         }
 

[NoCoverage] String mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:59:74
 
         private static string GetControllerName(FilterContext context)
         {
-            return context.RouteData.Values["controller"]?.ToString() ?? "None";
+            return context.RouteData.Values["controller"]?.ToString() ?? "";
         }
 

[Survived] Null coalescing mutation (remove left)
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:64:20
 
         private static string GetActionName(FilterContext context)
         {
-            return context.RouteData.Values["action"]?.ToString() ?? "None";
+            return "None";
         }
 

[Killed] Linq method mutation (FirstOrDefault() to First())
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:71:33
         {
             var userId = UserHelper.GetUserId(context.User).Value;
 
-            var boardIdString = context.Request.RouteValues
-                .FirstOrDefault(rv => rv.Key.EndsWith("boardId"))
+            var boardIdString = context.Request.RouteValues
+                .First(rv => rv.Key.EndsWith("boardId"))
                 .Value?.ToString();
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Survived] String mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:72:55
             var userId = UserHelper.GetUserId(context.User).Value;
 
             var boardIdString = context.Request.RouteValues
-                .FirstOrDefault(rv => rv.Key.EndsWith("boardId"))
+                .FirstOrDefault(rv => rv.Key.EndsWith(""))
                 .Value?.ToString();
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
WorthBoards.Api/Filters/ActionFilters/ControllerLoggingActionFilter.cs:75:17
                 .FirstOrDefault(rv => rv.Key.EndsWith("boardId"))
                 .Value?.ToString();
 
-            if (!int.TryParse(boardIdString, out var boardId))
+            if (int.TryParse(boardIdString, out var boardId))
                 return (null, null);
 
