[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:24:13
         public async Task<IActionResult> InviteUser(int boardId, [FromBody] InvitationRequest invitationRequest, CancellationToken cancellationToken)
         {
             var responsibleUserId = UserHelper.GetUserId(User).Value;
-            await _notificationService.NotifyBoardInvitation(boardId, invitationRequest.UserId, responsibleUserId, invitationRequest.Role, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.InviteUser_WithValidPayload_ReturnsNoContent

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:33:13
         public async Task<IActionResult> RemoveUser(int boardId, int userId, CancellationToken cancellationToken)
         {
             var responsibleUserId = UserHelper.GetUserId(User).Value;
-            await _boardOnUserService.UnlinkUserFromBoard(boardId, userId, responsibleUserId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.RemoveUser_WithoutPermission_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.RemoveUser_BySelf_ReturnsNoContent; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.RemoveUser_ByOwner_ReturnsNoContent

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:40:9
         [HttpGet("{boardId}/links")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetAllBoardToUserLinks(int boardId, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.GetAllBoardToUserLinks(boardId, cancellationToken);
-            return Ok(linkResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/link/{userId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetAllBoardToUserLinks_WithViewerRole_ReturnsOkAndAllLinks

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:48:9
         [HttpGet("{boardId}/link/{userId}")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetBoardToUserLink(int boardId, int userId, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.GetBoardToUserLink(boardId, userId, cancellationToken);
-            return Ok(linkResponse);
-        }
+        {}
 
         [HttpPost("{boardId}/link/{userId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetBoardToUserLink_WithNonexistentLink_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetBoardToUserLink_WithValidIds_ReturnsOkAndLinkData

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:56:9
         [HttpPost("{boardId}/link/{userId}")]
         [Authorize]
         public async Task<IActionResult> LinkUserToBoard(int boardId, int userId, [FromBody] LinkUserToBoardRequest linkUserToBoardRequest, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.LinkUserToBoard(boardId, userId, linkUserToBoardRequest, cancellationToken);
-            return CreatedAtAction(nameof(LinkUserToBoard), new { boardId = linkResponse.BoardId, userId = linkResponse.Id }, linkResponse);
-        }
+        {}
 
         [HttpPut("{boardId}/link/{userId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.LinkUserToBoard_WithValidPayload_ReturnsCreatedAndLinksUser

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:64:9
         [HttpPut("{boardId}/link/{userId}")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> UpdateUserOnBoard(int boardId, int userId, [FromBody] LinkUserToBoardRequest linkUserToBoardRequest, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.UpdateUserOnBoard(boardId, userId, linkUserToBoardRequest, cancellationToken);
-            return Ok(linkResponse);
-        }
+        {}
 
         [HttpPatch("{boardId}/link/{userId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.UpdateUserOnBoard_WithValidPayload_ReturnsOkAndUpdatesRole; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.UpdateUserOnBoard_WithNonexistentLink_ReturnsNotFound

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:72:9
         [HttpPatch("{boardId}/link/{userId}")]
         [AuthorizeRole(UserRoleEnum.EDITOR)]
         public async Task<IActionResult> PatchUserOnBoard(int boardId, int userId, [FromBody] JsonPatchDocument<LinkUserToBoardRequest> linkUserToBoardPatchDoc, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.PatchUserOnBoard(boardId, userId, linkUserToBoardPatchDoc, cancellationToken);
-            return Ok(linkResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/users")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.PatchUserOnBoard_OnOwnerUser_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.PatchUserOnBoard_WithValidPatch_ReturnsOkAndAppliesChanges

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:80:9
         [HttpGet("{boardId}/users")]
         [AuthorizeRole(UserRoleEnum.VIEWER)]
         public async Task<IActionResult> GetUsersLinkedToBoard(int boardId, CancellationToken cancellationToken)
-        {
-            var boardResponse = await _boardOnUserService.GetUsersLinkedToBoardAsync(boardId, cancellationToken);
-            return Ok(boardResponse);
-        }
+        {}
 
         [HttpGet("{boardId}/collaborators")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetUsersLinkedToBoard_WithNoUsers_ReturnsOkAndEmptyList; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetUsersLinkedToBoard_WithValidBoard_ReturnsOkAndUserList

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:88:9
         [HttpGet("{boardId}/collaborators")]
         [AuthorizeRole(UserRoleEnum.OWNER)]
         public async Task<ActionResult<IEnumerable<UserResponse>>> GetUsersByUserName([FromRoute] int boardId, [FromQuery] string userName, CancellationToken cancellationToken)
-        {
-            var userResponse = await _boardOnUserService.GetUsersByUserNameAsync(boardId, userName, cancellationToken);
-            return Ok(userResponse);
-        }
+        {}
 
         [HttpPost("{boardId}/collaborators/{newOwnerId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetUsersByUserName_WithValidUsername_ReturnsOkAndAvailableUsers

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:98:13
         public async Task<IActionResult> TransferOwnership([FromRoute] int boardId, int newOwnerId, CancellationToken cancellationToken)
         {
             var currentOwnerId = UserHelper.GetUserId(User).Value;
-            await _boardOnUserService.TransferOwnershipAsync(boardId, currentOwnerId, newOwnerId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.TransferOwnership_WithValidUser_ReturnsNoContent; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.TransferOwnership_ToUserNotOnBoard_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.TransferOwnership_ToSelf_ReturnsBadRequest
