[Survived] Conditional (true) mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:23:29
         {
             var (commentResponse, totalCount) = await _commentService.GetAllBoardTaskCommentsAsync(taskId, cancellationToken, pageNum, pageSize);
             
-            var pageCount = totalCount == 0 ? 1 : (int)Math.Ceiling((double)totalCount / pageSize);
+            var pageCount = (true?1 :(int)Math.Ceiling((double)totalCount / pageSize));
             return Ok(new {items = commentResponse, pageNumber = pageNum, pageCount, pageSize});
         }

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:29:9
 
         [HttpGet("{commentId}")]
         public async Task<IActionResult> GetCommentById([FromRoute] int taskId, int commentId, CancellationToken cancellationToken)
-        {
-            var commentResponse = await _commentService.GetCommentByIdAsync(taskId, commentId, cancellationToken);
-            
-            return Ok(commentResponse);
-        }
+        {}
 
         [HttpPost]
killedBy: WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.GetCommentById_WithValidIds_ReturnsOkAndCommentData; WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.GetCommentById_WithNonexistentComment_ReturnsNotFound

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:37:9
 
         [HttpPost]
         public async Task<IActionResult> CreateComment([FromRoute] int boardId, [FromRoute] int taskId, [FromBody] CommentRequest commentRequest, CancellationToken cancellationToken)
-        {
-            var userId = UserHelper.GetUserId(User);
-            if (userId.Result is UnauthorizedObjectResult unauthorizedResult)
-                return unauthorizedResult;
-
-            var commentResponse = await _commentService.CreateCommentAsync(userId.Value, taskId, commentRequest, cancellationToken);
-            return CreatedAtAction(nameof(GetCommentById), new { boardId = boardId, taskId = taskId, commentId = commentResponse.Id }, commentResponse);
-        }
+        {}
 
         [HttpDelete("{commentId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.CreateComment_WithValidData_ReturnsCreatedAndCommentData

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:49:13
         [HttpDelete("{commentId}")]
         public async Task<IActionResult> DeleteComment(int commentId, CancellationToken cancellationToken)
         {
-            await _commentService.DeleteCommentAsync(commentId, cancellationToken);
+            ;
             return NoContent();
         }
killedBy: WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.DeleteComment_WithNonexistentComment_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.DeleteComment_ByDifferentUser_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.DeleteComment_ByCommentOwner_ReturnsNoContent

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:55:9
 
         [HttpPut("{commentId}")]
         public async Task<IActionResult> UpdateComment(int commentId, [FromBody] CommentUpdateRequest commentRequest, CancellationToken cancellationToken)
-        {
-            var commentResponse = await _commentService.UpdateCommentAsync(commentId, commentRequest, cancellationToken);
-            return Ok(commentResponse);
-        }
+        {}
 
         [HttpPatch("{commentId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.UpdateComment_WithInvalidVersion_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.UpdateComment_ByDifferentUser_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.CommentControllerIntegrationTests.UpdateComment_WithValidData_ReturnsOkAndUpdatedComment

[NoCoverage] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/CommentController.cs:62:9
 
         [HttpPatch("{commentId}")]
         public async Task<IActionResult> PatchComment(int commentId, [FromBody] JsonPatchDocument<CommentUpdateRequest> commentPatchDoc, CancellationToken cancellationToken)
-        {
-            var commentResponse = await _commentService.PatchCommentAsync(commentId, commentPatchDoc, cancellationToken);
-            return Ok(commentResponse);
-        }
+        {}
     }
 }
