[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:12:43
 {
     public class HttpLoggingMiddleware
     {
-        private string[] sensitiveKeys = ["password", "token", "email", "resetcode"];
+        private string[] sensitiveKeys = ["", "token", "email", "resetcode"];
         private readonly RequestDelegate _next;
         private readonly ILogger<HttpLoggingMiddleware> _logger;

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:12:55
 {
     public class HttpLoggingMiddleware
     {
-        private string[] sensitiveKeys = ["password", "token", "email", "resetcode"];
+        private string[] sensitiveKeys = ["password", "", "email", "resetcode"];
         private readonly RequestDelegate _next;
         private readonly ILogger<HttpLoggingMiddleware> _logger;

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:17:9
         private readonly ILogger<HttpLoggingMiddleware> _logger;
 
         public HttpLoggingMiddleware(RequestDelegate next, ILogger<HttpLoggingMiddleware> logger)
-        {
-            _next = next;
-            _logger = logger;
-        }
+        {}
 
         public async Task InvokeAsync(HttpContext context)
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:24:13
 
         public async Task InvokeAsync(HttpContext context)
         {
-            LogRequest(context);
+            ;
 
             context.Response.OnCompleted(() =>

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:26:13
         {
             LogRequest(context);
 
-            context.Response.OnCompleted(() =>
-            {
-                LogResponse(context);
-                return Task.CompletedTask;
-            });
+            ;
 
             await _next(context);

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:28:17
 
             context.Response.OnCompleted(() =>
             {
-                LogResponse(context);
+                ;
                 return Task.CompletedTask;
             });

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:39:17
         {
             using (LogContext.PushProperty("LogType", "Http"))
             {
-                _logger.LogInformation("HTTP Request - IP: {ipAddress}, User: {User}, Method: {Method}, Path: {Path}, QueryString: {QueryString},\nRequestBody: {requestBody}",
-                    context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
-                    UserHelper.GetUsername(context),
-                    context.Request.Method,
-                    context.Request.Path,
-                    string.IsNullOrEmpty(context.Request.QueryString.Value) ? "None" : SanitizeQuery(context.Request.QueryString),
-                    GetJSONRequestBody(context));
+                ;
             }
         }

[Survived] Null coalescing mutation (remove left)
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:40:21
             using (LogContext.PushProperty("LogType", "Http"))
             {
                 _logger.LogInformation("HTTP Request - IP: {ipAddress}, User: {User}, Method: {Method}, Path: {Path}, QueryString: {QueryString},\nRequestBody: {requestBody}",
-                    context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
+                    "Unknown",
                     UserHelper.GetUsername(context),
                     context.Request.Method,

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:40:71
             using (LogContext.PushProperty("LogType", "Http"))
             {
                 _logger.LogInformation("HTTP Request - IP: {ipAddress}, User: {User}, Method: {Method}, Path: {Path}, QueryString: {QueryString},\nRequestBody: {requestBody}",
-                    context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
+                    context.Connection.RemoteIpAddress?.ToString() ?? "",
                     UserHelper.GetUsername(context),
                     context.Request.Method,

[Survived] Conditional (true) mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:44:21
                     UserHelper.GetUsername(context),
                     context.Request.Method,
                     context.Request.Path,
-                    string.IsNullOrEmpty(context.Request.QueryString.Value) ? "None" : SanitizeQuery(context.Request.QueryString),
+                    (true?"None" :SanitizeQuery(context.Request.QueryString)),
                     GetJSONRequestBody(context));
             }

[Survived] Conditional (false) mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:44:21
                     UserHelper.GetUsername(context),
                     context.Request.Method,
                     context.Request.Path,
-                    string.IsNullOrEmpty(context.Request.QueryString.Value) ? "None" : SanitizeQuery(context.Request.QueryString),
+                    (false?"None" :SanitizeQuery(context.Request.QueryString)),
                     GetJSONRequestBody(context));
             }

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:53:17
         {
             using (LogContext.PushProperty("LogType", "Http"))
             {
-                _logger.LogInformation("HTTP Response - IP: {ipAddress}, User: {User}, StatusCode: {StatusCode}",
-                   context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
-                   UserHelper.GetUsername(context),
-                   context.Response.StatusCode);
+                ;
             }
         }

[Survived] Null coalescing mutation (remove left)
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:54:20
             using (LogContext.PushProperty("LogType", "Http"))
             {
                 _logger.LogInformation("HTTP Response - IP: {ipAddress}, User: {User}, StatusCode: {StatusCode}",
-                   context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
+                   "Unknown",
                    UserHelper.GetUsername(context),
                    context.Response.StatusCode);

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:54:70
             using (LogContext.PushProperty("LogType", "Http"))
             {
                 _logger.LogInformation("HTTP Response - IP: {ipAddress}, User: {User}, StatusCode: {StatusCode}",
-                   context.Connection.RemoteIpAddress?.ToString() ?? "Unknown",
+                   context.Connection.RemoteIpAddress?.ToString() ?? "",
                    UserHelper.GetUsername(context),
                    context.Response.StatusCode);

[Survived] Boolean mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:62:79
 
         private string GetJSONRequestBody(HttpContext context)
         {
-            if (!context.Request.ContentType?.Contains("application/json") ?? true)
+            if (!context.Request.ContentType?.Contains("application/json") ?? false)
                 return "No JSON body.";
 

[Survived] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:62:17
 
         private string GetJSONRequestBody(HttpContext context)
         {
-            if (!context.Request.ContentType?.Contains("application/json") ?? true)
+            if (!(!context.Request.ContentType?.Contains("application/json") ?? true))
                 return "No JSON body.";
 

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:63:24
         private string GetJSONRequestBody(HttpContext context)
         {
             if (!context.Request.ContentType?.Contains("application/json") ?? true)
-                return "No JSON body.";
+                return "";
 
             context.Request.EnableBuffering();

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:65:13
             if (!context.Request.ContentType?.Contains("application/json") ?? true)
                 return "No JSON body.";
 
-            context.Request.EnableBuffering();
+            ;
             using (var reader = new StreamReader(
                 context.Request.Body,
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Survived] Boolean mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:69:51
             using (var reader = new StreamReader(
                 context.Request.Body,
                 encoding: Encoding.UTF8,
-                detectEncodingFromByteOrderMarks: false,
+                detectEncodingFromByteOrderMarks: true,
                 leaveOpen: true))
             {

[Killed] Boolean mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:70:28
                 context.Request.Body,
                 encoding: Encoding.UTF8,
                 detectEncodingFromByteOrderMarks: false,
-                leaveOpen: true))
+                leaveOpen: false))
             {
                 var requestBodyString = reader.ReadToEndAsync().Result;
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest

[Survived] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:71:13
                 encoding: Encoding.UTF8,
                 detectEncodingFromByteOrderMarks: false,
                 leaveOpen: true))
-            {
-                var requestBodyString = reader.ReadToEndAsync().Result;
-
-                context.Request.Body.Position = 0;
-
-                return SanitizeBody(requestBodyString);
-            }
+            {}
         }
 

[Survived] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:91:29
                 {
                     foreach (var keyword in sensitiveKeys)
                     {
-                        if (prop.Name.Contains(keyword, StringComparison.OrdinalIgnoreCase))
+                        if (!(prop.Name.Contains(keyword, StringComparison.OrdinalIgnoreCase)))
                             prop.Value = "***REDACTED***";
                     }

[Survived] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:111:25
             var sanitizedQuery = queryCollection.Select(qr => {
                 foreach (var key in sensitiveKeys)
                 {
-                    if (qr.Key.Contains(key, StringComparison.OrdinalIgnoreCase))
+                    if (!(qr.Key.Contains(key, StringComparison.OrdinalIgnoreCase)))
                         return new KeyValuePair<string, StringValues>(qr.Key, "***REDACTED***");
                 }

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Middlewares/HttpLoggingMiddleware.cs:118:65
                 return qr;
             });
 
-            return string.Join("&", sanitizedQuery.Select(qr => $"{qr.Key}={qr.Value}"));
+            return string.Join("&", sanitizedQuery.Select(qr => $""));
         }
     }
