[Survived] Statement mutation
WorthBoards.Api/Utils/ExceptionHandler/GlobalExceptionHandler.cs:22:13
         public async ValueTask<bool> TryHandleAsync(HttpContext httpContext, Exception exception, CancellationToken cancellationToken)
         {
             ErrorDetails response;
-            httpContext.Response.Headers.Append(HeaderNames.ContentType, MediaTypeNames.Application.Json);
+            ;
 
             switch (exception)

[Killed] Object initializer mutation
WorthBoards.Api/Utils/ExceptionHandler/GlobalExceptionHandler.cs:33:32
 
                 default:
                     httpContext.Response.StatusCode = (int)HttpStatusCode.InternalServerError;
-                    response = new ErrorDetails
-                    {
-                        StatusCode = (int)HttpStatusCode.InternalServerError,
-                        Title = HttpStatusCode.InternalServerError.ToString(),
-                        Details = exception.Message ?? "An unexpected error occurred."
-                    };
+                    response = new ErrorDetails
+{};
                     break;
             }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.LinkUserToBoard_WithAlreadyLinkedUser_ReturnsBadRequest

[Survived] Null coalescing mutation (remove left)
WorthBoards.Api/Utils/ExceptionHandler/GlobalExceptionHandler.cs:37:35
                     {
                         StatusCode = (int)HttpStatusCode.InternalServerError,
                         Title = HttpStatusCode.InternalServerError.ToString(),
-                        Details = exception.Message ?? "An unexpected error occurred."
+                        Details = "An unexpected error occurred."
                     };
                     break;

[Survived] Statement mutation
WorthBoards.Api/Utils/ExceptionHandler/GlobalExceptionHandler.cs:43:13
             }
 
 
-            await httpContext.Response.WriteAsJsonAsync(response, jsonOptions, cancellationToken);
+            ;
             return true;
         }

[Killed] Boolean mutation
WorthBoards.Api/Utils/ExceptionHandler/GlobalExceptionHandler.cs:44:20
 
 
             await httpContext.Response.WriteAsJsonAsync(response, jsonOptions, cancellationToken);
-            return true;
+            return false;
         }
     }
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest
