[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/NotificationController.cs:20:9
         if (userId.Result is UnauthorizedObjectResult unauthorizedResult)
             return unauthorizedResult;
 
-        await _notificationService.AcceptInvitation(notificationId, userId.Value, cancellationToken);
+        ;
         return NoContent();
     }
killedBy: WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.AcceptInvitation_WithNonexistentNotification_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.AcceptInvitation_WithValidInvitationNotification_ReturnsOkAndAddsUserToBoard; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.AcceptInvitation_WithNonInvitationNotification_ReturnsBadRequest

[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/NotificationController.cs:26:5
 
     [HttpGet]
     public async Task<IActionResult> GetNotificationsByUserId(CancellationToken cancellationToken = default)
-    {
-        var userId = UserHelper.GetUserId(User);
-        var notifications = await _notificationService.GetNotificationsByUserId(userId.Value, cancellationToken);
-        return Ok(notifications);
-    }
+    {}
 
     [HttpDelete("{notificationId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.GetNotificationsByUserId_WithNoNotifications_ReturnsOkAndEmptyList; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.GetNotificationsByUserId_WithExistingNotifications_ReturnsOkAndNotificationList

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/NotificationController.cs:37:9
     {
         var userId = UserHelper.GetUserId(User);
 
-        await _notificationService.UnlinkNotification(userId.Value, notificationId, cancellationToken);
+        ;
         return Ok();
     }
killedBy: WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.DeleteNotification_WithNonexistentNotification_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.DeleteNotification_WithValidNotification_ReturnsNoContent; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.DeleteNotification_ByUnauthorizedUser_ReturnsForbidden

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/NotificationController.cs:45:9
     public async Task<IActionResult> DeleteAllNotifications(CancellationToken cancellationToken = default)
     {
         var userId = UserHelper.GetUserId(User);
-        await _notificationService.UnlinkAllNotifications(userId.Value, cancellationToken);
+        ;
         return Ok();
     }
killedBy: WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.DeleteAllNotifications_WithMultipleNotifications_ReturnsNoContent; WorthBoards.IntegrationTests.Controllers.NotificationControllerIntegrationTests.DeleteAllNotifications_WithNoNotifications_ReturnsNoContent
