[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/UserHelper.cs:11:17
         public static ActionResult<int> GetUserId(ClaimsPrincipal user)
         {
             string? userIdString = user.FindFirst(ClaimTypes.NameIdentifier)?.Value;
-            if (string.IsNullOrEmpty(userIdString) || !int.TryParse(userIdString, out int parsedUserId))
+            if ((userIdString!="") || !int.TryParse(userIdString, out int parsedUserId))
             {
                 return new UnauthorizedObjectResult("Invalid user ID.");
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.CreateBoard_WithValidData_ReturnsCreatedAndBoardData; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithValidBoardId_ReturnsOkAndBoardData; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetAllCurrentUserBoards_WithValidUser_ReturnsOkAndBoardList

[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/UserHelper.cs:11:17
         public static ActionResult<int> GetUserId(ClaimsPrincipal user)
         {
             string? userIdString = user.FindFirst(ClaimTypes.NameIdentifier)?.Value;
-            if (string.IsNullOrEmpty(userIdString) || !int.TryParse(userIdString, out int parsedUserId))
+            if ((userIdString!=null) || !int.TryParse(userIdString, out int parsedUserId))
             {
                 return new UnauthorizedObjectResult("Invalid user ID.");
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.CreateBoard_WithValidData_ReturnsCreatedAndBoardData; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_WithValidBoardId_ReturnsOkAndBoardData

[Survived] Null coalescing mutation (remove left)
Bakalaurui PSK project/WorthBoards.Api/Utils/UserHelper.cs:20:20
 
         public static string GetUsername(HttpContext context)
         {
-            return context.User.Identity?.Name ?? "Anonymous";
+            return "Anonymous";
         }
     }

[Survived] String mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/UserHelper.cs:20:51
 
         public static string GetUsername(HttpContext context)
         {
-            return context.User.Identity?.Name ?? "Anonymous";
+            return context.User.Identity?.Name ?? "";
         }
     }
