[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/UploadController.cs:16:13
     [Authorize]
     public async Task<IActionResult> UploadImage(IFormFile image, CancellationToken cancellationToken)
     {
-        if (image is null)
+        if (image is not null)
             return BadRequest();
 
killedBy: WorthBoards.IntegrationTests.Controllers.UploadControllerIntegrationTests.UploadImage_WithJpegImage_ReturnsOkAndFilename; WorthBoards.IntegrationTests.Controllers.UploadControllerIntegrationTests.UploadImage_WithValidImageFile_ReturnsOkAndFilename; WorthBoards.IntegrationTests.Controllers.UploadControllerIntegrationTests.UploadImage_WithEmptyFile_ReturnsBadRequest

[Survived] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/UploadController.cs:20:9
             return BadRequest();
 
         int userId = UserHelper.GetUserId(User).Value;
-        Console.WriteLine($"{userId}, Uploaded image: {image.FileName}");
+        ;
         var filename = await _fileService.UploadImage(image);
 
