[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/UserController.cs:37:9
         [HttpPut("{userId}")]
         [Authorize]
         public async Task<IActionResult> UpdateUserOnBoard(int userId, [FromBody] UserUpdateRequest userUpdateRequest, CancellationToken cancellationToken)
-        {
-            var userResponse = await _userService.UpdateUser(userId, userUpdateRequest, cancellationToken);
-            return Ok(userResponse);
-        }
+        {}
     }
 }
killedBy: WorthBoards.IntegrationTests.Controllers.UserControllerIntegrationTests.UpdateUserOnBoard_WithPartialData_ReturnsOkAndUpdatesProvidedFields; WorthBoards.IntegrationTests.Controllers.UserControllerIntegrationTests.UpdateUserOnBoard_WithValidData_ReturnsOkAndUpdatedUser
