[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/DependencyInjection.cs:11:13
     {
         public static IServiceCollection AddApiServices(this IServiceCollection services, IConfiguration configuration)
         {
-            services.AddExceptionHandler<GlobalExceptionHandler>();
+            ;
 
             services.AddScoped<IAuthorizationHandler, PermissionHandler>();
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest

[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/DependencyInjection.cs:13:13
         {
             services.AddExceptionHandler<GlobalExceptionHandler>();
 
-            services.AddScoped<IAuthorizationHandler, PermissionHandler>();
+            ;
 
             return services;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest
