[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:9:1
 
 var builder = WebApplication.CreateBuilder(args);
 
-builder
-    .ConfigureLogger()
-    .ConfigureSwagger()
-    .ConfigureGmail()
-    .ConfigureAuthentication()
-    .ConfigureAuthorization()
-    .ConfigureValidators();
+;
 
 builder.Services.AddApiServices(builder.Configuration);
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:17:1
     .ConfigureAuthorization()
     .ConfigureValidators();
 
-builder.Services.AddApiServices(builder.Configuration);
+;
 builder.Services.AddBusinessServices(builder.Configuration);
 builder.Services.AddDataServices(builder.Configuration);
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest

[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:18:1
     .ConfigureValidators();
 
 builder.Services.AddApiServices(builder.Configuration);
-builder.Services.AddBusinessServices(builder.Configuration);
+;
 builder.Services.AddDataServices(builder.Configuration);
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest

[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:19:1
 
 builder.Services.AddApiServices(builder.Configuration);
 builder.Services.AddBusinessServices(builder.Configuration);
-builder.Services.AddDataServices(builder.Configuration);
+;
 
 builder.Services.AddControllers(options =>
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword

[Killed] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:21:1
 builder.Services.AddBusinessServices(builder.Configuration);
 builder.Services.AddDataServices(builder.Configuration);
 
-builder.Services.AddControllers(options =>
-{
-    var useControllerLoggingActionFilter = builder.Configuration.GetValue<bool>("Logger:UseControllerLoggingActionFilter");
-    if (useControllerLoggingActionFilter)
-        options.Filters.Add<ControllerLoggingActionFilter>();
-}
-).AddNewtonsoftJson();
+;
 builder.Services.AddScoped<ControllerLoggingActionFilter>();
 
killedBy: WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ResetPassword_WithInvalidResetCode_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.ChangePassword_WithValidOldPassword_ReturnsOkAndChangesPassword; WorthBoards.IntegrationTests.Controllers.AuthControllerIntegrationTests.LoginUserAsync_WithEmptyUsername_ReturnsBadRequest

[Survived] Negate expression
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:24:9
 builder.Services.AddControllers(options =>
 {
     var useControllerLoggingActionFilter = builder.Configuration.GetValue<bool>("Logger:UseControllerLoggingActionFilter");
-    if (useControllerLoggingActionFilter)
+    if (!(useControllerLoggingActionFilter))
         options.Filters.Add<ControllerLoggingActionFilter>();
 }

[Survived] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:25:9
 {
     var useControllerLoggingActionFilter = builder.Configuration.GetValue<bool>("Logger:UseControllerLoggingActionFilter");
     if (useControllerLoggingActionFilter)
-        options.Filters.Add<ControllerLoggingActionFilter>();
+        ;
 }
 ).AddNewtonsoftJson();

[Survived] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:28:1
         options.Filters.Add<ControllerLoggingActionFilter>();
 }
 ).AddNewtonsoftJson();
-builder.Services.AddScoped<ControllerLoggingActionFilter>();
+;
 
 var baseUrl = builder.Configuration.GetValue<string>("BaseUrl") ?? string.Empty;

[Survived] Null coalescing mutation (remove left)
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:30:15
 ).AddNewtonsoftJson();
 builder.Services.AddScoped<ControllerLoggingActionFilter>();
 
-var baseUrl = builder.Configuration.GetValue<string>("BaseUrl") ?? string.Empty;
+var baseUrl = string.Empty;
 builder.WebHost.UseUrls(baseUrl);
 

[NoCoverage] String mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:30:68
 ).AddNewtonsoftJson();
 builder.Services.AddScoped<ControllerLoggingActionFilter>();
 
-var baseUrl = builder.Configuration.GetValue<string>("BaseUrl") ?? string.Empty;
+var baseUrl = builder.Configuration.GetValue<string>("BaseUrl") ?? "Stryker was here!";
 builder.WebHost.UseUrls(baseUrl);
 

[Survived] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:31:1
 builder.Services.AddScoped<ControllerLoggingActionFilter>();
 
 var baseUrl = builder.Configuration.GetValue<string>("BaseUrl") ?? string.Empty;
-builder.WebHost.UseUrls(baseUrl);
+;
 
 builder.Services.AddCors(options =>

[Survived] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:45:1
 
 var app = builder.Build();
 
-app.ConfigureStaticImages();
+;
 
 if (app.Environment.IsDevelopment())

[Survived] Negate expression
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:76:5
 app.UseAuthorization();
 
 var useHttpLoggingMiddleware = builder.Configuration.GetValue<bool>("Logger:UseHttpLoggingMiddleware");
-if (useHttpLoggingMiddleware)
+if (!(useHttpLoggingMiddleware))
     app.UseMiddleware<HttpLoggingMiddleware>();
 

[Survived] Statement mutation
Desktop/Bakalaurui PSK project/WorthBoards.Api/Program.cs:77:5
 
 var useHttpLoggingMiddleware = builder.Configuration.GetValue<bool>("Logger:UseHttpLoggingMiddleware");
 if (useHttpLoggingMiddleware)
-    app.UseMiddleware<HttpLoggingMiddleware>();
+    ;
 
 app.MapControllers();
