[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/AuthorizeRoleAttribute.cs:9:9
     public class AuthorizeRoleAttribute : AuthorizeAttribute
     {
         public AuthorizeRoleAttribute(UserRoleEnum role)
-        {
-            Policy = role.ToString();
-        }
+        {}
     }
 }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_OnNonexistentBoard_ReturnsNotFound; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.DeleteBoard_WithoutOwnerRole_ReturnsForbidden
