[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:15:17
             var httpContext = (context.Resource as DefaultHttpContext)?.HttpContext;
             var routeValues = httpContext?.Request.RouteValues;
 
-            if (routeValues is null)
+            if (routeValues is not null)
             {
                 return;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Survived] Linq method mutation (FirstOrDefault() to First())
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:20:30
                 return;
             }
 
-            var boardIdObj = routeValues.FirstOrDefault(kv => kv.Key.ToLower().EndsWith("id")).Value;
+            var boardIdObj = routeValues.First(kv => kv.Key.ToLower().EndsWith("id")).Value;
             var boardId = boardIdObj?.ToString();
             if (string.IsNullOrEmpty(boardId))

[Killed] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:22:17
 
             var boardIdObj = routeValues.FirstOrDefault(kv => kv.Key.ToLower().EndsWith("id")).Value;
             var boardId = boardIdObj?.ToString();
-            if (string.IsNullOrEmpty(boardId))
+            if (!(string.IsNullOrEmpty(boardId)))
             {
                 return;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] String mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:22:17
 
             var boardIdObj = routeValues.FirstOrDefault(kv => kv.Key.ToLower().EndsWith("id")).Value;
             var boardId = boardIdObj?.ToString();
-            if (string.IsNullOrEmpty(boardId))
+            if ((boardId!=null))
             {
                 return;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:28:17
             }
 
             var userId = context.User.FindFirst(ClaimTypes.NameIdentifier)?.Value;
-            if (userId is null)
+            if (userId is not null)
             {
                 return;
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Equality mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:35:17
 
             var userRole = await boardService.GetUserRoleByBoardIdAndUserIdAsync(int.Parse(boardId), int.Parse(userId));
 
-            if (userRole <= Enum.Parse<UserRoleEnum>(requirement.Role))
+            if (userRole > Enum.Parse<UserRoleEnum>(requirement.Role))
                 context.Succeed(requirement);
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest

[Killed] Negate expression
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:35:17
 
             var userRole = await boardService.GetUserRoleByBoardIdAndUserIdAsync(int.Parse(boardId), int.Parse(userId));
 
-            if (userRole <= Enum.Parse<UserRoleEnum>(requirement.Role))
+            if (!(userRole <= Enum.Parse<UserRoleEnum>(requirement.Role)))
                 context.Succeed(requirement);
         }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges

[Killed] Statement mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionHandler.cs:36:17
             var userRole = await boardService.GetUserRoleByBoardIdAndUserIdAsync(int.Parse(boardId), int.Parse(userId));
 
             if (userRole <= Enum.Parse<UserRoleEnum>(requirement.Role))
-                context.Succeed(requirement);
+                ;
         }
     }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest
