[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Utils/PermissionRequirement.cs:11:9
         public string Role { get; set; }
 
         public PermissionRequirement(UserRoleEnum role)
-        {
-            Role = role.ToString();
-        }
+        {}
     }
 }
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_WithInvalidPatchDocument_ReturnsBadRequest; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.PatchBoard_PatchMultipleFields_ReturnsOkAndAppliesAllChanges; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.UpdateBoard_WithInvalidVersion_ReturnsBadRequest
