[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardController.cs:38:9
         [HttpGet("{boardId}")]
         [Authorize]
         public async Task<IActionResult> GetBoardById(int boardId, CancellationToken cancellationToken)
-        {
-            var boardResponse = await _boardService.GetBoardByIdAsync(boardId, cancellationToken);
-            return Ok(boardResponse);
-        }
+        {}
 
         [HttpPost]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_ValidBoardId_ReturnsOkWithBoardData; WorthBoards.IntegrationTests.Controllers.BoardControllerIntegrationTests.GetBoardById_NonExistentBoardId_ReturnsNotFound
