[Killed] Block removal mutation
Bakalaurui PSK project/WorthBoards.Api/Controllers/BoardOnUserController.cs:56:9
         [HttpPost("{boardId}/link/{userId}")]
         [Authorize]
         public async Task<IActionResult> LinkUserToBoard(int boardId, int userId, [FromBody] LinkUserToBoardRequest linkUserToBoardRequest, CancellationToken cancellationToken)
-        {
-            var linkResponse = await _boardOnUserService.LinkUserToBoard(boardId, userId, linkUserToBoardRequest, cancellationToken);
-            return CreatedAtAction(nameof(LinkUserToBoard), new { boardId = linkResponse.BoardId, userId = linkResponse.UserId }, linkResponse);
-        }
+        {}
 
         [HttpPut("{boardId}/link/{userId}")]
killedBy: WorthBoards.IntegrationTests.Controllers.BoardTaskControllerIntegrationTests.CreateBoardTask_WithoutEditorRole_ReturnsForbidden; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.GetUsersLinkedToBoard_ValidBoard_ReturnsOkWithUsersList; WorthBoards.IntegrationTests.Controllers.BoardOnUserControllerIntegrationTests.LinkUserToBoard_ValidRequest_ReturnsCreatedWithLinkData
